; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person city flevel - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (nxt ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1)
		 (nxt ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (nxt ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-20)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city14)
	(fuel-level plane1 fl5)
	(at plane2 city11)
	(fuel-level plane2 fl0)
	(at plane3 city4)
	(fuel-level plane3 fl5)
	(at plane4 city11)
	(fuel-level plane4 fl3)
	(at plane5 city15)
	(fuel-level plane5 fl2)
	(at person1 city0)
	(at person2 city14)
	(at person3 city12)
	(at person4 city7)
	(at person5 city4)
	(at person6 city14)
	(at person7 city4)
	(at person8 city0)
	(at person9 city3)
	(at person10 city7)
	(at person11 city3)
	(at person12 city15)
	(at person13 city10)
	(at person14 city1)
	(at person15 city7)
	(at person16 city9)
	(at person17 city7)
	(at person18 city5)
	(at person19 city11)
	(at person20 city0)
	(nxt fl0 fl1)
	(nxt fl1 fl2)
	(nxt fl2 fl3)
	(nxt fl3 fl4)
	(nxt fl4 fl5)
	(nxt fl5 fl6)
)
(:goal (and
	(at plane1 city14)
	(at plane3 city7)
	(at plane5 city12)
	(at person1 city4)
	(at person2 city11)
	(at person3 city0)
	(at person4 city12)
	(at person5 city12)
	(at person6 city0)
	(at person7 city5)
	(at person8 city13)
	(at person9 city9)
	(at person10 city7)
	(at person11 city7)
	(at person12 city6)
	(at person13 city2)
	(at person14 city10)
	(at person15 city14)
	(at person16 city12)
	(at person17 city1)
	(at person18 city1)
	(at person19 city5)
	(at person20 city13)
	))

)

; plan
1. (board person2 plane1 city14)
   deleted: (at person2 city14)
   added: (in person2 plane1)
   goals met: 2 of 23
2. (board person5 plane3 city4)
   deleted: (at person5 city4)
   added: (in person5 plane3)
   goals met: 2 of 23
3. (board person6 plane1 city14)
   deleted: (at person6 city14)
   added: (in person6 plane1)
   goals met: 2 of 23
4. (board person7 plane3 city4)
   deleted: (at person7 city4)
   added: (in person7 plane3)
   goals met: 2 of 23
5. (board person12 plane5 city15)
   deleted: (at person12 city15)
   added: (in person12 plane5)
   goals met: 2 of 23
6. (board person19 plane4 city11)
   deleted: (at person19 city11)
   added: (in person19 plane4)
   goals met: 2 of 23
7. (fly plane3 city4 city0 fl5 fl4)
   deleted: (at plane3 city4) (fuel-level plane3 fl5)
   added: (at plane3 city0) (fuel-level plane3 fl4)
   goals met: 2 of 23
8. (board person1 plane3 city0)
   deleted: (at person1 city0)
   added: (in person1 plane3)
   goals met: 2 of 23
9. (board person8 plane3 city0)
   deleted: (at person8 city0)
   added: (in person8 plane3)
   goals met: 2 of 23
10. (board person20 plane3 city0)
   deleted: (at person20 city0)
   added: (in person20 plane3)
   goals met: 2 of 23
11. (fly plane5 city15 city3 fl2 fl1)
   deleted: (at plane5 city15) (fuel-level plane5 fl2)
   added: (at plane5 city3) (fuel-level plane5 fl1)
   goals met: 2 of 23
12. (board person9 plane5 city3)
   deleted: (at person9 city3)
   added: (in person9 plane5)
   goals met: 2 of 23
13. (board person11 plane5 city3)
   deleted: (at person11 city3)
   added: (in person11 plane5)
   goals met: 2 of 23
14. (fly plane4 city11 city5 fl3 fl2)
   deleted: (at plane4 city11) (fuel-level plane4 fl3)
   added: (at plane4 city5) (fuel-level plane4 fl2)
   goals met: 2 of 23
15. (board person18 plane4 city5)
   deleted: (at person18 city5)
   added: (in person18 plane4)
   goals met: 2 of 23
16. (debark person19 plane4 city5)
   deleted: (in person19 plane4)
   added: (at person19 city5)
   goals met: 3 of 23
17. (zoom plane4 city5 city1 fl2 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl2)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 3 of 23
18. (debark person18 plane4 city1)
   deleted: (in person18 plane4)
   added: (at person18 city1)
   goals met: 4 of 23
19. (fly plane3 city0 city4 fl4 fl3)
   deleted: (at plane3 city0) (fuel-level plane3 fl4)
   added: (at plane3 city4) (fuel-level plane3 fl3)
   goals met: 4 of 23
20. (debark person1 plane3 city4)
   deleted: (in person1 plane3)
   added: (at person1 city4)
   goals met: 5 of 23
21. (fly plane3 city4 city5 fl3 fl2)
   deleted: (at plane3 city4) (fuel-level plane3 fl3)
   added: (at plane3 city5) (fuel-level plane3 fl2)
   goals met: 5 of 23
22. (debark person7 plane3 city5)
   deleted: (in person7 plane3)
   added: (at person7 city5)
   goals met: 6 of 23
23. (fly plane3 city5 city13 fl2 fl1)
   deleted: (at plane3 city5) (fuel-level plane3 fl2)
   added: (at plane3 city13) (fuel-level plane3 fl1)
   goals met: 6 of 23
24. (debark person8 plane3 city13)
   deleted: (in person8 plane3)
   added: (at person8 city13)
   goals met: 7 of 23
25. (debark person20 plane3 city13)
   deleted: (in person20 plane3)
   added: (at person20 city13)
   goals met: 8 of 23
26. (fly plane1 city14 city11 fl5 fl4)
   deleted: (at plane1 city14) (fuel-level plane1 fl5)
   added: (at plane1 city11) (fuel-level plane1 fl4)
   goals met: 7 of 23
27. (debark person2 plane1 city11)
   deleted: (in person2 plane1)
   added: (at person2 city11)
   goals met: 8 of 23
28. (fly plane1 city11 city0 fl4 fl3)
   deleted: (at plane1 city11) (fuel-level plane1 fl4)
   added: (at plane1 city0) (fuel-level plane1 fl3)
   goals met: 8 of 23
29. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   goals met: 9 of 23
30. (fly plane1 city0 city12 fl3 fl2)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city12) (fuel-level plane1 fl2)
   goals met: 9 of 23
31. (zoom plane1 city12 city14 fl2 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl2)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 10 of 23
32. (fly plane3 city13 city12 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 10 of 23
33. (debark person5 plane3 city12)
   deleted: (in person5 plane3)
   added: (at person5 city12)
   goals met: 11 of 23
34. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 23
35. (board person3 plane3 city12)
   deleted: (at person3 city12)
   added: (in person3 plane3)
   goals met: 11 of 23
36. (fly plane3 city12 city0 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 11 of 23
37. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 23
38. (debark person3 plane3 city0)
   deleted: (in person3 plane3)
   added: (at person3 city0)
   goals met: 12 of 23
39. (fly plane3 city0 city7 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 13 of 23
40. (fly plane5 city3 city9 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 13 of 23
41. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 13 of 23
42. (board person16 plane5 city9)
   deleted: (at person16 city9)
   added: (in person16 plane5)
   goals met: 13 of 23
43. (debark person9 plane5 city9)
   deleted: (in person9 plane5)
   added: (at person9 city9)
   goals met: 14 of 23
44. (fly plane5 city9 city7 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 14 of 23
45. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 23
46. (board person4 plane5 city7)
   deleted: (at person4 city7)
   added: (in person4 plane5)
   goals met: 14 of 23
47. (board person15 plane5 city7)
   deleted: (at person15 city7)
   added: (in person15 plane5)
   goals met: 14 of 23
48. (board person17 plane5 city7)
   deleted: (at person17 city7)
   added: (in person17 plane5)
   goals met: 14 of 23
49. (debark person11 plane5 city7)
   deleted: (in person11 plane5)
   added: (at person11 city7)
   goals met: 15 of 23
50. (fly plane5 city7 city6 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city6) (fuel-level plane5 fl0)
   goals met: 15 of 23
51. (refuel plane5 city6 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 15 of 23
52. (debark person12 plane5 city6)
   deleted: (in person12 plane5)
   added: (at person12 city6)
   goals met: 16 of 23
53. (fly plane5 city6 city14 fl1 fl0)
   deleted: (at plane5 city6) (fuel-level plane5 fl1)
   added: (at plane5 city14) (fuel-level plane5 fl0)
   goals met: 16 of 23
54. (refuel plane5 city14 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 23
55. (debark person15 plane5 city14)
   deleted: (in person15 plane5)
   added: (at person15 city14)
   goals met: 17 of 23
56. (fly plane5 city14 city1 fl1 fl0)
   deleted: (at plane5 city14) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 17 of 23
57. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 23
58. (board person14 plane5 city1)
   deleted: (at person14 city1)
   added: (in person14 plane5)
   goals met: 17 of 23
59. (debark person17 plane5 city1)
   deleted: (in person17 plane5)
   added: (at person17 city1)
   goals met: 18 of 23
60. (fly plane5 city1 city10 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 18 of 23
61. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 23
62. (board person13 plane5 city10)
   deleted: (at person13 city10)
   added: (in person13 plane5)
   goals met: 18 of 23
63. (debark person14 plane5 city10)
   deleted: (in person14 plane5)
   added: (at person14 city10)
   goals met: 19 of 23
64. (fly plane5 city10 city2 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 19 of 23
65. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 19 of 23
66. (debark person13 plane5 city2)
   deleted: (in person13 plane5)
   added: (at person13 city2)
   goals met: 20 of 23
67. (fly plane5 city2 city12 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city12) (fuel-level plane5 fl0)
   goals met: 21 of 23
68. (debark person4 plane5 city12)
   deleted: (in person4 plane5)
   added: (at person4 city12)
   goals met: 22 of 23
69. (debark person16 plane5 city12)
   deleted: (in person16 plane5)
   added: (at person16 city12)
   goals met: 23 of 23
